In [2]:
import numpy as np
import pandas as pd

### Some important Series method :

In [3]:
bollywood_df = pd.read_csv("Session_16_Dataset/bollywood.csv", index_col = 'movie')
bollywood_df.index = bollywood_df.index.str.strip().str.lower().str.replace(' ', '_')
bollywood_df

                                                  lead
movie
uri:_the_surgical_strike                 Vicky Kaushal
battalion_609                              Vicky Ahuja
the_accidental_prime_minister_(film)       Anupam Kher
why_cheat_india                          Emraan Hashmi
evening_shadows                       Mona Ambegaonkar
...                                                ...
hum_tumhare_hain_sanam                  Shah Rukh Khan
aankhen_(2002_film)                   Amitabh Bachchan
saathiya_(film)                           Vivek Oberoi
company_(film)                              Ajay Devgn
awara_paagal_deewana                      Akshay Kumar

[1500 rows x 1 columns]

In [4]:
bollywood_df

                                                  lead
movie
uri:_the_surgical_strike                 Vicky Kaushal
battalion_609                              Vicky Ahuja
the_accidental_prime_minister_(film)       Anupam Kher
why_cheat_india                          Emraan Hashmi
evening_shadows                       Mona Ambegaonkar
...                                                ...
hum_tumhare_hain_sanam                  Shah Rukh Khan
aankhen_(2002_film)                   Amitabh Bachchan
saathiya_(film)                           Vivek Oberoi
company_(film)                              Ajay Devgn
awara_paagal_deewana                      Akshay Kumar

[1500 rows x 1 columns]

In [3]:
vk = pd.read_csv("Session_16_Dataset/kohli_ipl.csv", index_col = 'match_no')
vk

          runs
match_no
1            1
2           23
3           13
4           12
5            1
...        ...
211          0
212         20
213         73
214         25
215          7

[215 rows x 1 columns]

In [144]:
channel_subs = pd.read_csv("Session_16_Dataset/subs.csv")
channel_subs.rename(columns = lambda x:x.strip().lower().replace(' ', '_'), inplace = True)

In [145]:
channel_subs

     subscribers_gained
0                    48
1                    57
2                    40
3                    43
4                    44
..                  ...
360                 231
361                 226
362                 155
363                 144
364                 172

[365 rows x 1 columns]

In [6]:
"""
astype():
         This is particularly useful when you need to convert the data type of one or more columns in a DataFrame or a Series to a different type,
         such as converting integers to floats, integer to string, or objects to categorical data.

Syntax :
        DataFrame.astype(dtype, copy=True, errors='raise')
        Series.astype(dtype, copy=True, errors='raise')
"""

# converting a series to a different data type:
import pandas as pd

# Create a Series
s = pd.Series([1, 2, 3, 4])

# Convert the Series to float
s_float = s.astype('float64')
print(s_float)

0    1.0
1    2.0
2    3.0
3    4.0
dtype: float64

In [19]:
df = pd.DataFrame({
    'A' : [1,2,4,5,5,5,6,9,8,9],
    'B' : [1.24 , 4.2, 42.5, 5.2, 5.3, 52.5,43.53, 53.8, 53.2, 52.5],
    'C' : ['1', '54', '7', '5', '52', '5', '9', '8', '9', '10']
})
# convert integer to float
df['A'] = df['A'].astype('float64')

# convert float to integer
df['B'] = df['B'].astype('int64')

# convert string to integer
df['C'] = df['C'].astype('int64')
df.tail(4)

     A   B   C
6  6.0  43   9
7  9.0  53   8
8  8.0  53   9
9  9.0  52  10

In [20]:
# converting a dataFrame column to a different data type :
import pandas as pd

# Create a DataFrame
df = pd.DataFrame({
    'A' : [ 1,2,4,4,5],
    'B' : [ 2.3 , 45.2, 42.2, 41.2, 44.1],
    'C' : [ '3', '5', '3', '2' , '9']
})

# Convert column 'A' to float
df['A'] = df['A'].astype('float32')

# convert column 'B' to integer
df['B'] = df['B'].astype('int64')

# Convert column 'C' to integer
df['C'] = df['C'].astype('int64')
df

     A   B  C
0  1.0   2  3
1  2.0  45  5
2  4.0  42  3
3  4.0  41  2
4  5.0  44  9

In [22]:
# Second method and efficient method to convert different datatype in different form
df = df.astype({'A' : 'float32', 'B': 'int64', 'C':'int64'})
df.head()

     A   B  C
0  1.0   2  3
1  2.0  45  5
2  4.0  42  3
3  4.0  41  2
4  5.0  44  9

In [17]:
# converting multiple column to a different data type:
df = pd.DataFrame({
    'name' : ['majid', 'amjad' , 'amir', 'ayan', 'yasir'],
    'age' : [ '33', '11', '22', '2', '5'],
    'stc' : [ 15.5 , 10.4, 8.6, 4.3, 6.7]
})

# convert name column to str, age to int, stc to int
df = df.astype({ 'age' : 'float32', 'stc' : 'int32'})
df

    name   age  stc
0  majid  33.0   15
1  amjad  11.0   10
2   amir  22.0    8
3   ayan   2.0    4
4  yasir   5.0    6

In [19]:
# handling errors during conversion:
import pandas as pd

# Create a Series with mixed types
s = pd.Series(['1', '2', 'three'])

# Try to convert to integer, ignoring errors
s_int = s.astype('int64', errors='ignore')

print(s_int)

0        1
1        2
2    three
dtype: object

### Between():

In [68]:
type(vk)

pandas.core.frame.DataFrame

In [71]:
"""
between():
          The between() function in pandas is used to filter data within a specified range. It returns a boolean Series or DataFrame indicating
          whether each element lies between the specified lower and upper bounds. This function is particularly useful for filtering rows based
          on a range of values in a column.
"""

# example:
# Agar Series type dataset hai tb ye between directly use ho ga agr ye dataframe hai to specific column select kar ye karna pare ga.
# find the number b/w 40 to 100 of runs of vk:
  
vk[vk['runs'].between(50, 100)].size

47

In [29]:
# using between with a DataFrame column:
import pandas as pd

# Create a DataFrame
df = pd.DataFrame({
    'A': [10, 20, 30, 40, 50],
    'B': [5, 15, 25, 35, 45]
})

# Filter rows where column 'A' is between 20 and 40 (inclusive)
filtered_df = df[df['A'].between(10, 40)]
print(filtered_df)

    A   B
0  10   5
1  20  15
2  30  25
3  40  35

### clip():

In [37]:
"""
clip():
     The clip() function in pandas is used to limit the values in a Series or DataFrame to a specified range.
     Values below the lower bound are replaced with the lower bound, and values above the upper bound are replaced
     with the upper bound. This is useful for handling outliers or ensuring that data stays within a specific range.

Syntax:
        Series.clip(lower=None, upper=None, axis=None, inplace=False)
        DataFrame.clip(lower=None, upper=None, axis=None, inplace=False)

"""

# exampel:
cliped_data = vk.clip(20, 100)
cliped_data

match_no
1      20
2      23
3      20
4      20
5      20
       ..
211    20
212    20
213    73
214    25
215    20
Name: runs, Length: 215, dtype: int64

In [38]:
# using clip on a DataFrame 
import pandas as pd

# Create a DataFrame
df = pd.DataFrame({
    'A': [1, 2, 3, 4, 5],
    'B': [10, 20, 30, 40, 50]
})

# Clip values to a range between 2 and 40
clipped_df = df.clip(lower=2, upper=40)
print(clipped_df)

   A   B
0  2  10
1  2  20
2  3  30
3  4  40
4  5  40

In [39]:
# apply clip on a specific column:
df['A'] = df['A'].clip(2,4)
df

   A   B
0  2  10
1  2  20
2  3  30
3  4  40
4  4  50

In [40]:
# apply clip() on a row wise and column wize:
import pandas as pd

# Create a DataFrame
df = pd.DataFrame({
    'A': [1, 2, 3, 4, 5],
    'B': [10, 20, 30, 40, 50]
})

# Clip row-wise (each row is clipped independently)
clipped_df = df.clip(lower=[2, 15], upper=[4, 35], axis=1)
print(clipped_df)

   A   B
0  2  15
1  2  20
2  3  30
3  4  35
4  4  35

### drop_duplicates() :

In [31]:
"""
drop_dublicates():
                  The drop_duplicates() function in pandas is used to remove duplicate rows from a DataFrame or Series. It is a handy tool for cleaning
                  data, especially when dealing with datasets that may contain repeated entries. You can specify which columns to consider when
                  identifying duplicates and whether to keep the first or last occurrence of the duplicate rows.
Syntax:
       DataFrame.drop_duplicates(subset=None, keep='first', inplace=False, ignore_index=False)
       Series.drop_duplicates(keep='first', inplace=False)
"""
# example: first check whether duplicate data exist by using of duplicated()
np.where(vk.duplicated())

# and by using of sum() it means it count duplicated values
# These given output is in index number where most of the values are duplicated.

(array([  4,  12,  21,  22,  25,  26,  28,  29,  30,  32,  34,  37,  38,
         39,  46,  48,  49,  53,  54,  57,  58,  60,  63,  65,  66,  68,
         69,  71,  72,  74,  75,  76,  79,  82,  83,  84,  86,  87,  88,
         89,  90,  91,  92,  93,  94,  95,  96,  97,  98,  99, 101, 102,
        104, 105, 106, 108, 110, 112, 113, 114, 120, 123, 124, 126, 129,
        130, 131, 134, 135, 137, 138, 140, 141, 142, 143, 145, 146, 148,
        149, 150, 151, 152, 153, 154, 155, 157, 158, 160, 161, 162, 163,
        164, 165, 166, 167, 168, 169, 170, 171, 173, 176, 178, 179, 180,
        181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193,
        194, 195, 196, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207,
        208, 209, 210, 211, 212, 213, 214], dtype=int64),)

In [33]:
vk[181:214]

          runs
match_no
182         50
183          8
184          6
185         33
186         33
187          5
188         72
189          8
190         12
191         35
192          5
193         25
194          5
195          4
196         25
197         51
198         53
199         39
200         41
201         12
202          5
203         48
204          1
205         12
206          0
207          0
208          9
209         58
210         30
211          0
212         20
213         73
214         25

In [48]:
# length:215 to length:78 it means many rows are duplicated
vk.drop_duplicates().size

78

In [73]:
subs

     Subscribers gained
0                    48
1                    57
2                    40
3                    43
4                    44
..                  ...
360                 231
361                 226
362                 155
363                 144
364                 172

[365 rows x 1 columns]

In [41]:
# specific columns you want to remove you can do this

subs[subs.duplicated(subset = 'Subscribers gained')].size

185

In [65]:
# this values is duplicated in subscribers channel
subs[subs.duplicated()].size

185

In [43]:
# this values is unique in subscriber gained :
subs.drop_duplicates(subset = 'Subscribers gained').size

180

In [12]:
# pandas series:
duplicate_data = pd.Series([1,2,2,3,3,4,4,5,5,6,6])
print(duplicate_data)
print(duplicate_data[duplicate_data.duplicated()].size)    # this will give, in our data 5 values are repeated
print('this is for non_missing values\n',duplicate_data.count())

0     1
1     2
2     2
3     3
4     3
5     4
6     4
7     5
8     5
9     6
10    6
dtype: int64
5
this is for non_missing values
 11

In [84]:
duplicate_data.size

11

In [85]:
# this is syntax [keep = 'last' or 'first' ] it will only take whose value is given bydefault [keep = 'fist']
duplicate_data.drop_duplicates(keep = 'last').size

6

### isnull() fillna():

In [4]:
"""
isnull():
         The isnull() function in pandas is used to detect missing or null values (NaN, None, or NaT) in a DataFrame or Series. It returns a boolean
         object (DataFrame or Series) of the same shape, where each element is True if the corresponding value is missing, and False otherwise.
         This function is particularly useful for identifying and handling missing data in datasets.
"""
# it means there is no null column by using of count attribute it count only those values those are non missing.

import numpy as np
print(vk.isnull().sum())
vk.shape

runs    0
dtype: int64

(215, 1)

In [5]:
# This filtered data tell that where is null values existing with index
temp = pd.Series([1,2,3, np.nan, 5, np.nan, 7, np.nan, 9, 10])
temp[temp.isnull()]

3   NaN
5   NaN
7   NaN
dtype: float64

In [15]:
# there is only non_missing values.
temp.count()

7

In [19]:
# by using of sum() it give the sum of all null values in our data
temp.isnull().sum()

3

In [6]:
# this is temporary changed : which means fill those values those are nan 

temp.fillna(f'{ np.mean(temp):.1f}')

0     1.0
1     2.0
2     3.0
3     5.3
4     5.0
5     5.3
6     7.0
7     5.3
8     9.0
9    10.0
dtype: object

In [90]:
# there is no any column null 
subs.isnull().sum()

Subscribers gained    0
dtype: int64

In [92]:
# there is also no column or rows is not null
bollywood_df.isnull().sum()

movie    0
lead     0
dtype: int64

### dropna():

In [102]:
"""
dropna():
         The dropna() function is used to remove rows or columns with missing values from a DataFrame or Series.

Syntax:
       DataFrame.dropna(axis=0, how='any', thresh=None, subset=None, inplace=False)
       Series.dropna(axis=0, inplace=False)

"""
# example: it removes all those rows and columns those values are missing
temp.dropna()

0     1.0
1     2.0
2     3.0
4     5.0
6     7.0
8     9.0
9    10.0
dtype: float64

In [114]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    "A": [1, 2, np.nan, 4],
    "B": [5, np.nan, np.nan, 8],
    "C": [9, 10, 11, 12],
    "D": [2,3,4.2 ,32],
    "E" : [ 12, np.nan , np.nan , 5]
})

print("Original DataFrame:\n", df)

Original DataFrame:
      A    B   C     D     E
0  1.0  5.0   9   2.0  12.0
1  2.0  NaN  10   3.0   NaN
2  NaN  NaN  11   4.2   NaN
3  4.0  8.0  12  32.0   5.0

In [106]:
# columns wise missing values detect karna
missing_check = df.apply(lambda row : row.isnull().sum() , axis = 0)
missing_check

A    1
B    2
C    0
D    0
E    2
dtype: int64

In [115]:
df.dropna(subset = ["A"], inplace = True)

In [127]:
df

     A    B   C     D     E
0  1.0  5.0   9   2.0  12.0
1  2.0  NaN  10   3.0   NaN
3  4.0  8.0  12  32.0   5.0

In [128]:
# fill each column with their each mean
mean_each_colmn = df.mean(numeric_only = True).to_dict()
for key, value in mean_each_colmn.items():
    # print(key, value)
    print(f'{key}->{value:.2f}')
fill_with_mean = df.fillna(mean_each_colmn)
print(fill_with_mean)

A->2.33
B->6.50
C->10.33
D->12.33
E->8.50
     A    B   C     D     E
0  1.0  5.0   9   2.0  12.0
1  2.0  6.5  10   3.0   8.5
3  4.0  8.0  12  32.0   5.0

In [46]:
df.dropna(how = 'any')

     A    B   C     D     E
0  1.0  5.0   9   2.0  12.0
3  4.0  8.0  12  32.0   5.0

In [47]:
df.dropna()

     A    B   C     D     E
0  1.0  5.0   9   2.0  12.0
3  4.0  8.0  12  32.0   5.0

### fillna() :

In [58]:
"""
fillna():
         The fillna() function is used to fill missing values in a DataFrame or Series with a specified value or method.

Syntax: 
       DataFrame.fillna(value=None, method=None, axis=None, inplace=False, limit=None)
       Series.fillna(value=None, method=None, inplace=False, limit=None)
"""
# example: by filling of missing values with the use of fillna() function
temp.fillna(4)       # it will fill all missing rows and columns

0     1.0
1     2.0
2     3.0
3    5.29
4     5.0
5    5.29
6     7.0
7    5.29
8     9.0
9    10.0
dtype: object

In [61]:
# if we want to fill values with this data mean we can do
temp.fillna(f'{temp.mean():.2f}')    # it will fill all values with this data mean

0     1.0
1     2.0
2     3.0
3    5.29
4     5.0
5    5.29
6     7.0
7    5.29
8     9.0
9    10.0
dtype: object

In [8]:
# suppose i have this dataframe dataset

# Create a DataFrame with missing values
df = pd.DataFrame({
    'A': [1, 2, np.nan, 4],
    'B': [5, np.nan, None, 8],
    'C': [np.nan, np.nan, np.nan, 8],
     "E" : [ 12, np.nan , np.nan , 5]
})

df

     A    B    C     E
0  1.0  5.0  NaN  12.0
1  2.0  NaN  NaN   NaN
2  NaN  NaN  NaN   NaN
3  4.0  8.0  8.0   5.0

In [9]:
# First I want to remove those rows and columns which is mostly missing values
df.dropna(thresh = 2, inplace = True)

In [10]:
df

     A    B    C     E
0  1.0  5.0  NaN  12.0
3  4.0  8.0  8.0   5.0

In [12]:
# fill missing values with the column specific values.
# df = df.dropna(thresh = 'all', inplace = True)
mean_value = df.mean(numeric_only = True).to_dict()
fill_with_mean = df.fillna(mean_value, axis = 0)
fill_with_mean

     A    B    C     E
0  1.0  5.0  8.0  12.0
3  4.0  8.0  8.0   5.0

### isin():

In [13]:
"""
isin():
       The isin() function in pandas is used to filter rows in a DataFrame or Series based on whether the values are contained in a specified list,
       Series, or DataFrame. It returns a boolean mask indicating whether each element is present in the provided collection. This function is 
       particularly useful for filtering data based on specific values or categories.
"""
# example: find from vk dataset that he make runs any random values like 34, 23, or etc....
vk[vk.isin([32, 23, 74, 20])].duplicated().sum()

211

In [119]:
vk[vk.isin(np.arange(50,56))]

match_no
15     50
71     51
103    51
122    52
129    54
131    54
137    55
182    50
197    51
198    53
Name: runs, dtype: int64

In [97]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    'A': [1, 2, np.nan, 4],
    'B': [5, np.nan, None, 8],
    'C': [7, 2, 9, 8]
})

# Check if elements are in given list
mask = df.isin([2, 8, 9])
print(mask)

       A      B      C
0  False  False  False
1   True  False   True
2  False  False   True
3  False   True   True

In [99]:
# Only those rows shows where in columns A is 1 and 4
df = df[df['A'].isin([1,4])]
df

     A    B  C
0  1.0  5.0  7
3  4.0  8.0  8

### apply():

In [132]:
"""
apply():
        The apply() function in pandas is used to apply a function along an axis (rows or columns) of a DataFrame or to each element of a Series.
        It is a highly flexible and powerful tool for performing custom operations on your data. You can use it with built-in functions,
        lambda functions, or custom-defined functions.
syntax:
        DataFrame.apply(func, axis=0, raw=False, result_type=None, args=(), **kwargs)
        func → function jo apply karna hai (built-in ya custom).
        axis=0 → column-wise apply karega (default).
        axis=1 → row-wise apply karega.


"""
bollywood_df

                                                  lead
movie
uri:_the_surgical_strike                 Vicky Kaushal
battalion_609                              Vicky Ahuja
the_accidental_prime_minister_(film)       Anupam Kher
why_cheat_india                          Emraan Hashmi
evening_shadows                       Mona Ambegaonkar
...                                                ...
hum_tumhare_hain_sanam                  Shah Rukh Khan
aankhen_(2002_film)                   Amitabh Bachchan
saathiya_(film)                           Vivek Oberoi
company_(film)                              Ajay Devgn
awara_paagal_deewana                      Akshay Kumar

[1500 rows x 1 columns]

In [135]:
# The reason here why not picking movie because this is index not a column name or feature
# bollywood_df['movie'].head()

In [139]:
# apply(): by used of apply function if someone say to me to split the actors name and just give me first name of actors like salman khan to salman:

apply_func= bollywood_df['lead'].apply(lambda x :x.split()[0].upper())
apply_func

movie
uri:_the_surgical_strike                  VICKY
battalion_609                             VICKY
the_accidental_prime_minister_(film)     ANUPAM
why_cheat_india                          EMRAAN
evening_shadows                            MONA
                                         ...
hum_tumhare_hain_sanam                     SHAH
aankhen_(2002_film)                     AMITABH
saathiya_(film)                           VIVEK
company_(film)                             AJAY
awara_paagal_deewana                     AKSHAY
Name: lead, Length: 1500, dtype: object

In [129]:
# Custom function with apply mehtod
def my_func(x):
    return x.max() - x.min()

# Apply per column
result = df.apply(my_func)
print("\nRange (max-min) per column:\n", result)

Range (max-min) per column:
 A     3.0
B     3.0
C     3.0
D    30.0
E     7.0
dtype: float64

In [130]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    'A': [1, 2, np.nan, 4],
    'B': [5, np.nan, None, 8],
    'C': [7, 2, 9, 8]
})

print("Original DF:\n", df)

# Apply sum on each column
col_sum = df.apply(np.sum)
print("\nColumn-wise sum:\n", col_sum)

Original DF:
      A    B  C
0  1.0  5.0  7
1  2.0  NaN  2
2  NaN  NaN  9
3  4.0  8.0  8

Column-wise sum:
 A     7.0
B    13.0
C    26.0
dtype: float64

In [147]:
channel_subs

     subscribers_gained
0                    48
1                    57
2                    40
3                    43
4                    44
..                  ...
360                 231
361                 226
362                 155
363                 144
364                 172

[365 rows x 1 columns]

In [140]:
import pandas as pd

# Example Series
subs = pd.Series([10, 20, 30, 40, 50])

# Apply the lambda function
result = subs.apply(lambda x: 'Good days' if x>subs.mean() else 'Bad days')
result

0     Bad days
1     Bad days
2     Bad days
3    Good days
4    Good days
dtype: object

In [148]:
subs_mean = channel_subs.mean()
subs_mean

subscribers_gained    135.643836
dtype: float64

In [155]:
# It means these days my channel gained less than mean

channel_subs[channel_subs < subs_mean].count()

subscribers_gained    202
dtype: int64

In [156]:
# It means these days my channel gained greater than all average and i'm happy these days

channel_subs[channel_subs > subs_mean].count()

subscribers_gained    163
dtype: int64

In [158]:
# apply(): by of this function i can perform lambda function
# resutl = subs.apply(lambda x:'good days' if x > subs.mean() else 'bad days')
# result
# don't now why give this an error
result = channel_subs['subscribers_gained'].apply(lambda x: 'good days' if x > channel_subs['subscribers_gained'].mean() else 'bad days')  
result

0       bad days
1       bad days
2       bad days
3       bad days
4       bad days
         ...
360    good days
361    good days
362    good days
363    good days
364    good days
Name: subscribers_gained, Length: 365, dtype: object

In [161]:
# These index where my subscribers less than mean
np.where(result[result == 'bad days'])

(array([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,
         13,  14,  15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,
         26,  27,  28,  29,  30,  31,  32,  33,  34,  35,  36,  37,  38,
         39,  40,  41,  42,  43,  44,  45,  46,  47,  48,  49,  50,  51,
         52,  53,  54,  55,  56,  57,  58,  59,  60,  61,  62,  63,  64,
         65,  66,  67,  68,  69,  70,  71,  72,  73,  74,  75,  76,  77,
         78,  79,  80,  81,  82,  83,  84,  85,  86,  87,  88,  89,  90,
         91,  92,  93,  94,  95,  96,  97,  98,  99, 100, 101, 102, 103,
        104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116,
        117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129,
        130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142,
        143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155,
        156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168,
        169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181,
        182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194,
        195, 196, 197, 198, 199, 200, 201], dtype=int64),)

In [22]:
result[result == 'good days'].count()

163

### copy():

In [157]:
"""
copy():
        The copy() function in pandas is used to create a deep copy of a DataFrame or Series. This means that the new object is completely independent
        of the original, and any modifications to the copied object will not affect the original, and vice versa. This is particularly useful when you
        want to manipulate or analyze data without altering the original dataset.

Why Use copy()? :
                Avoid Unintended Modifications: If you assign a DataFrame or Series to a new variable without using copy(),
                both variables will reference the same object in memory. Changes to one will affect the other.

     Create Independent Copies: Using copy() ensures that the new object is independent, so you can safely modify it without worrying about side effects.

Key Points:
           Use copy() to create an independent copy of a DataFrame or Series.
           Modifications to the copied object will not affect the original, and vice versa.
           This is particularly useful when you want to manipulate or analyze data without altering the original dataset.

When to Use copy():
                   Data Manipulation:   When you need to perform operations on a dataset but want to preserve the original.
                   Experimentation:     When you want to test changes without affecting the original data.
                Avoiding Side Effects:   When working with functions that modify data in-place, creating a copy ensures the original data remains intact.

"""
vk

match_no
1       1
2      23
3      13
4      12
5       1
       ..
211     0
212    20
213    73
214    25
215     7
Name: runs, Length: 215, dtype: int64

In [162]:
# from original data take head which means first five rows:
head_data = vk.head()
head_data

match_no
1     1
2    23
3    13
4    12
5     1
Name: runs, dtype: int64

In [163]:
# this is a copy of head: but if i want to modified this data i can do but it's modification will not affect on original dataset
new_data = head_data.copy()
new_data

match_no
1     1
2    23
3    13
4    12
5     1
Name: runs, dtype: int64

In [172]:
# i want to change in 4 index not 12 i give 30 it permanently modified but in copied data not original :
new_data[5] = 50
new_data

match_no
1     1
2    23
3    13
4    30
5    50
Name: runs, dtype: int64

In [173]:
# now i check the mofication in data does affect in original data
print(" original data", head_data)
print("modified data " , new_data)

# it simpy mean when we want to modified any dataset we copy of it then we perform operation and etc..

 original data match_no
1     1
2    23
3    13
4    12
5     1
Name: runs, dtype: int64
modified data  match_no
1     1
2    23
3    13
4    30
5    50
Name: runs, dtype: int64

### copy() :

In [163]:
# load dataset
import pandas as pd

# Load the dataset
subs = pd.read_csv('Session_16_Dataset/subs.csv')
subs.rename(columns = lambda x:x.strip().lower().replace(' ', '_'), inplace = True) 
# Display the first few rows
subs.head()

   subscribers_gained
0                  48
1                  57
2                  40
3                  43
4                  44

In [164]:
# create the copy of the dataSet
# Create a deep copy of the dataset
subs_copy = subs.copy()

# Display the first few rows of the copy
subs_copy.head()

   subscribers_gained
0                  48
1                  57
2                  40
3                  43
4                  44

In [166]:
# Verify independence of the copy:
# Modify the copied dataset and verify that the original dataset remains unchanged:

# Modify the copied dataset
subs_copy['subscribers_gained'] = subs_copy['subscribers_gained'] * 2

# Display the first few rows of the modified copy
print("Modified Copy:")
print(subs_copy.head())

# Display the first few rows of the original dataset
print("\nOriginal Dataset:")
print(subs.head())

Modified Copy:
   subscribers_gained
0                  96
1                 114
2                  80
3                  86
4                  88

Original Dataset:
   subscribers_gained
0                  48
1                  57
2                  40
3                  43
4                  44

In [174]:
print(f'Mean of dataset:\n {subs.mean()}')
print(f'median of dataset:\n {subs.median()}')
print(f'minimum of dataset:\n {subs.min()}')
print(f'maximum of dataset:\n {subs.max()}')

Mean of dataset:
 subscribers_gained    135.643836
dtype: float64
median of dataset:
 subscribers_gained    123.0
dtype: float64
minimum of dataset:
 subscribers_gained    33
dtype: int64
maximum of dataset:
 subscribers_gained    396
dtype: int64

In [181]:
""" Use case for copy() :
A common use case for copy() is when you want to perform operations on a dataset without altering the original. For example, let's classify the 
"Subscribers gained" column into "good days" and "bad days" based on the mean, but do so on a copy of the dataset:
"""
# Create a copy of the dataset
subs_copy = subs.copy()

# Calculate the mean of the "Subscribers gained" column
mean_subs = subs_copy['subscribers_gained'].mean()

# Classify each value as "good days" or "bad days"
subs_copy['Classification'] = subs_copy['subscribers_gained'].apply(
    lambda x: 'Very Nice days' if x >= 200 else ('Good Days' if x >= mean_subs else 'bad days')
)


# Display the first few rows of the modified copy
print(subs_copy.sample(10))

     subscribers_gained  Classification
263                 184       Good Days
39                   62        bad days
57                   72        bad days
243                 173       Good Days
113                  96        bad days
124                  77        bad days
227                 214  Very Nice days
107                 100        bad days
180                  93        bad days
91                   81        bad days

In [4]:
import pandas as pd
df1 = pd.DataFrame({"ID":[1,2], "Name":["Ali","Sara"]})
df2 = pd.DataFrame({"ID":[1,2], "Score":[90,88]})

pd.merge(df1, df2, on="ID")

   ID  Name  Score
0   1   Ali     90
1   2  Sara     88

In [5]:
dates = pd.date_range("2025-01-01", periods=6)
ts = pd.Series([1,2,3,4,5,6], index=dates)
ts.resample("2D").sum()

2025-01-01     3
2025-01-03     7
2025-01-05    11
Freq: 2D, dtype: int64

In [7]:
data = {
    "Name": ["Majid", "Ali", "Sara"],
    "Age": [22, 25, 23],
    "Score": [90, 85, 88]
}

df = pd.DataFrame(data)
df

    Name  Age  Score
0  Majid   22     90
1    Ali   25     85
2   Sara   23     88

In [9]:
# Z-score method (outliers ka approx detection)
import numpy as np
z_scores = (df["Score"] - df["Score"].mean()) / df["Score"].std()
df = df[(np.abs(z_scores) < 3)]
df

    Name  Age  Score
0  Majid   22     90
1    Ali   25     85
2   Sara   23     88

In [10]:
df["Age_group"] = pd.cut(df["Age"], bins=[0,18,35,60,100], labels=["Teen","Young","Adult","Senior"])
df

    Name  Age  Score Age_group
0  Majid   22     90     Young
1    Ali   25     85     Young
2   Sara   23     88     Young

## Last Update:

In [183]:
import calendar
yy = 2025
mm = 8
print(calendar.month(yy, mm))

    August 2025
Mo Tu We Th Fr Sa Su
             1  2  3
 4  5  6  7  8  9 10
11 12 13 14 15 16 17
18 19 20 21 22 23 24
25 26 27 28 29 30 31

In [184]:
from datetime import datetime
day = datetime.today().day
print(day)

31